/***************************************************************************************************
 В этом файле находятся функции расчета CRC (скопированные с википедии).
 
 Для подсчета CRC-32 выделяется локальный массив размером в 1 Килобайт!
 
***************************************************************************************************/

#include "umba_crc.h"

#ifdef __cplusplus
extern "C" {
#endif

/***************************************************************************************************
                            Локальные дефайны
***************************************************************************************************/

/***************************************************************************************************
                            Локальные типы данных
***************************************************************************************************/

/***************************************************************************************************
                            Прототипы локальных функций
***************************************************************************************************/

/***************************************************************************************************
                            Локальные переменные файла
***************************************************************************************************/

/***************************************************************************************************
                            Глобальные переменные для проекта, геттеры и сеттеры к ним
***************************************************************************************************/

/***************************************************************************************************
                            Глобальные функции
***************************************************************************************************/

/***********************************************************************************************************************************
Описание:  Функция подсчета CRC-8
Аргументы: const uint8_t * buf - указатель на массив данных, на который считается CRC 
           uint32_t len - длина массива
Возврат:   посчитанная CRC-8 
Замечания:
***********************************************************************************************************************************/
uint8_t umba_crc8(const uint8_t * buf, uint32_t len)
{   
    // Name  : CRC-8
    // Poly  : 0x31    x^8 + x^5 + x^4 + 1
    // Init  : 0xFF
    // Revert: false
    // XorOut: 0x00
    // Check : 0xF7 ("123456789")
    // MaxLen: 15 байт(127 бит) - обнаружение одинарных, двойных, тройных и всех нечетных ошибок
    
   uint8_t crc = 0xFF;
   uint8_t i;

   while (len--)
    {
        crc ^= *buf++;
 
        for ( i = 0; i < 8; i++)
            crc = crc & 0x80 ? (crc << 1) ^ 0x31 : crc << 1;
    }
 
    return crc;
}


/***********************************************************************************************************************************
Описание:  Функция подсчета CRC-16
Аргументы: const uint8_t * buf - указатель на массив данных, на который считается CRC 
           uint32_t len - длина массива
Возврат:   посчитанная CRC-16
Замечания:
***********************************************************************************************************************************/
uint16_t umba_crc16(const uint8_t * buf, uint32_t len)
{
    // Name  : CRC-16 CCITT
    // Poly  : 0x1021    x^16 + x^12 + x^5 + 1
    // Init  : 0xFFFF
    // Revert: false
    // XorOut: 0x0000
    // Check : 0x29B1 ("123456789")
    // MaxLen: 4095 байт (32767 бит) - обнаружение одинарных, двойных, тройных и всех нечетных ошибок
    
    uint16_t crc = 0xFFFF;
     
    while (len--)
    {
        uint8_t i;
        
        crc ^= *buf++ << 8;
        
        for (i = 0; i < 8; i++)
            crc = crc & 0x8000 ? (crc << 1) ^ 0x1021 : crc << 1;
    }
 
    return crc;

}

/***********************************************************************************************************************************
Описание:  Функция подсчета CRC-32
Аргументы: const uint8_t * buf - указатель на массив данных, на который считается CRC 
           uint32_t len - длина массива
Возврат:   посчитанная CRC-32
Замечания: Выделяет локальный массив размером в 1 КИЛОБАЙТ!
***********************************************************************************************************************************/
uint32_t umba_crc32(const uint8_t * buf, uint32_t len)
{
    // Name  : CRC-32
    // Poly  : 0x04C11DB7    x^32 + x^26 + x^23 + x^22 + x^16 + x^12 + x^11 
                       // + x^10 + x^8 + x^7 + x^5 + x^4 + x^2 + x + 1
    // Init  : 0xFFFFFFFF
    // Revert: true
    // XorOut: 0xFFFFFFFF
    // Check : 0xCBF43926 ("123456789")
    // MaxLen: 268 435 455 байт (2 147 483 647 бит) - обнаружение одинарных, двойных, пакетных и всех нечетных ошибок

    uint32_t crc_table[256];
    uint32_t crc; 
    
    uint16_t i;
    for (i = 0; i < 256; i++)
    {
        uint16_t j;
        crc = i;
        for (j = 0; j < 8; j++)
            crc = crc & 1 ? (crc >> 1) ^ 0xEDB88320UL : crc >> 1;
 
        crc_table[i] = crc;
    };
 
    crc = 0xFFFFFFFFUL;
 
    while (len--) 
        crc = crc_table[(crc ^ *buf++) & 0xFF] ^ (crc >> 8);
 
    return crc ^ 0xFFFFFFFFUL;
}

/***************************************************************************************************
                            Локальные функции
***************************************************************************************************/

#ifdef __cplusplus
}
#endif
